Job2 - martin -  Soap - WCF/FinalService/FinalService/Service2.wsdl


<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://webservices.wialon.com/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" name="Service1" targetNamespace="http://webservices.wialon.com/">
	<wsdl:types>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="http://webservices.wialon.com/">
			<xs:import namespace="http://schemas.datacontract.org/2004/07/FinalService"/>
			<xs:element name="storeTelemetryList">
				<xs:complexType>
					<xs:sequence>
						<xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/FinalService" minOccurs="0" name="telemetryWithDetails" nillable="true" />
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="storeTelemetryListResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="storeTelemetryListResult" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
		</xs:schema>
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/">
			<xs:element name="anyType" nillable="true" type="xs:anyType"/>
			<xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
			<xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
			<xs:element name="boolean" nillable="true" type="xs:boolean"/>
			<xs:element name="byte" nillable="true" type="xs:byte"/>
			<xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
			<xs:element name="decimal" nillable="true" type="xs:decimal"/>
			<xs:element name="double" nillable="true" type="xs:double"/>
			<xs:element name="float" nillable="true" type="xs:float"/>
			<xs:element name="int" nillable="true" type="xs:int"/>
			<xs:element name="long" nillable="true" type="xs:long"/>
			<xs:element name="QName" nillable="true" type="xs:QName"/>
			<xs:element name="short" nillable="true" type="xs:short"/>
			<xs:element name="string" nillable="true" type="xs:string"/>
			<xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
			<xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
			<xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
			<xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
			<xs:element name="char" nillable="true" type="tns:char"/>
			<xs:simpleType name="char">
				<xs:restriction base="xs:int"/>
			</xs:simpleType>
			<xs:element name="duration" nillable="true" type="tns:duration"/>
			<xs:simpleType name="duration">
				<xs:restriction base="xs:duration">
					<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
					<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
					<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:element name="guid" nillable="true" type="tns:guid"/>
			<xs:simpleType name="guid">
				<xs:restriction base="xs:string">
					<xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:attribute name="FactoryType" type="xs:QName"/>
			<xs:attribute name="Id" type="xs:ID"/>
			<xs:attribute name="Ref" type="xs:IDREF"/>
		</xs:schema>
		
		<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified">
			<xs:complexType name="telemetry">
				<xs:sequence>
					<xs:element minOccurs="0" name="CoordX" type="xs:double"/>
					<xs:element minOccurs="0" name="CoordY" type="xs:double"/>
					<xs:element minOccurs="0" name="Date" type="xs:dateTime"/>
					<xs:element minOccurs="0" name="Glonass" type="xs:int"/>
					<xs:element minOccurs="0" name="GpsCode" nillable="true" type="xs:string"/>
					<xs:element minOccurs="0" name="Speed" type="xs:int"/>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="telemetry" nillable="true" type="telemetry"/>
		
			<xs:complexType name="telemetryDetails">
				<xs:sequence>
					<xs:element minOccurs="0" name="SensorCode" nillable="true" type="xs:string"/>
					<xs:element minOccurs="0" name="Value" type="xs:double"/>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="telemetryDetails" nillable="true" type="telemetryDetails"/>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="IService1_storeTelemetryList_InputMessage">
		<wsdl:part name="parameters" element="tns:storeTelemetryList"/>
	</wsdl:message>
	<wsdl:message name="IService1_storeTelemetryList_OutputMessage">
		<wsdl:part name="parameters" element="tns:storeTelemetryListResponse"/>
	</wsdl:message>
	<wsdl:portType name="IService1">
		<wsdl:operation name="storeTelemetryList">
			<wsdl:input wsaw:Action="http://webservices.wialon.com/IService1/storeTelemetryList" message="tns:IService1_storeTelemetryList_InputMessage"/>
			<wsdl:output wsaw:Action="http://webservices.wialon.com/IService1/storeTelemetryListResponse" message="tns:IService1_storeTelemetryList_OutputMessage"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="BasicHttpBinding_IService1" type="tns:IService1">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="storeTelemetryList">
			<soap:operation soapAction="http://webservices.wialon.com/IService1/storeTelemetryList" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="Service1">
		<wsdl:port name="BasicHttpBinding_IService1" binding="tns:BasicHttpBinding_IService1">
			<soap:address location="http://localhost:59824/Service1.svc"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>